app/controllers/animal_posts_controller.rb

  def index
  	@animal_posts = AnimalPost.all #variables with an @ are instance variables
---
SELECT "animal_posts".* FROM "animal_posts"

  def show
  	#uses the params hash to get the key (id for news_post)
  	@animal_post = AnimalPost.find(params[:id])
---
SELECT "animal_posts".* FROM "animal_posts" WHERE "animal_posts"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @animal_post = AnimalPost.new(animal_post_params)
    if @animal_post.save #saves to the database
---
INSERT INTO "animal_posts" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 22 Feb 2014 22:26:19 UTC +00:00], ["description", "is very fluffy!"], ["name", "Fluffy"], ["updated_at", Sat, 22 Feb 2014 22:26:19 UTC +00:00]]

  def edit
    @animal_post = AnimalPost.find(params[:id])
---
SELECT "animal_posts".* FROM "animal_posts" WHERE "animal_posts"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    @animal_post = AnimalPost.find(params[:id]) #fetch an existing record

    if @animal_post.update(animal_post_params)
---
SELECT "animal_posts".* FROM "animal_posts" WHERE "animal_posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "animal_posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "animal_posts"."id" = 2  [["title", "Snowy"], ["body", "isSnowy"], ["updated_at", Sat, 22 Feb 2014 20:28:45 UTC +00:00]]

  def destroy
    @animal_post = AnimalPost.find(params[:id])
    @animal_post.destroy
---
SELECT "animal_posts".* FROM "animal_posts" WHERE "animal_posts"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "animal_posts" WHERE "animal_posts"."id" = $1  [["id", 2]]